Обработки/Reports/_РасчетВознагражденияФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетВознагражденияФонда</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетВознагражденияФонда/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Отчет.Период.ДатаНачала 	= НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
	Отчет.Период.ДатаОкончания 	= КонецМесяца(Отчет.Период.ДатаНачала);
		
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Отчет.Подписант = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(Подписант, Отчет.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьИмяФайла();
	ПриОткрытииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Отчет.Период.ДатаНачала 	= НачалоМесяца(Отчет.Период.ДатаОкончания);
	Отчет.Период.ДатаОкончания 	= КонецМесяца(Отчет.Период.ДатаОкончания);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
	УстановитьИмяФайла();

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	УстановитьИмяФайла();
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Отчет.Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = Неопределено;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ВыбранноеЗначение, Отчет.Организация);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.КонтактныеЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	КонецЕсли;	
		
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьСтруктуруДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрано некорректное значение!");
		ВыбранноеЗначение = Неопределено;
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	Отчет.Подписант = СтруктураДанныхКонтактногоЛица;
	//Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	КонецЕсли;
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте
Процедура УстановитьИмяФайла()
	
	Элементы.Результат.ИспользуемоеИмяФайла = "Вознаграждение " + СокрЛП(Отчет.СчетДоверительногоУправления) + " с "+ Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
